Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)


cd into your exercises folder for this module and run echo env.py >> .gitignore

Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [23]:
def get_db_url(username,password,hostname):
    database = input('what database?: ')
    return f'mysql+pymysql://{username}:{password}@{hostname}/{database}'

In [16]:
import env
import pandas as pd
import numpy as np

Use your function to obtain a connection to the employees database.

In [24]:
url = get_db_url(env.user, env.password,env.host)
pd.read_sql('select * from employees limit 5', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
wrong_url = get_db_url(env.user, env.password,env.host,'employe')
# pd.read_sql('select * from employees limit 5', wrong_url)
# pd.read_sql('select from employees limit 5', url)

Read the employees and titles tables into two separate DataFrames.

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [28]:
employees_df = pd.read_sql('select * from employees', url)

In [33]:
url

'mysql+pymysql://ursula_2337:z9RyZEps6entaumVqIFL3DhKuSaobzus@data.codeup.com/employees'

In [29]:
titles_df = pd.read_sql('select * from titles', url)

In [31]:
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [32]:
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

Display the summary statistics for each DataFrame.

In [34]:
employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [35]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

How many unique titles are in the titles DataFrame?

In [41]:
unique_titles = pd.read_sql('select distinct title from titles',url)

In [42]:
unique_titles

                title
0     Senior Engineer
1               Staff
2            Engineer
3        Senior Staff
4  Assistant Engineer
5    Technique Leader
6             Manager

In [68]:
titles_df['title'].unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

What is the oldest date in the to_date column?

In [53]:
(titles_df['to_date'].min())

datetime.date(1985, 3, 1)

What is the most recent date in the to_date column?

In [49]:
titles_df['titles'].max()

datetime.date(9999, 1, 1)

In [64]:
# titles_df[['to_date'] == '1985-03-01']
titles_df[(titles_df['to_date']) == (titles_df['to_date'].min())]

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01